{
    "jokeList": ["What do you call a smiling black man? Snigger","Did you hear about the 9 year old African nigglet? He was going through a mid-life crisis.","What do black men do after sex? 15 years to life.","What's the difference between a black and a white fairytale? White begins, \"once upon a time,\" black begins, \"y'all motherfuckers ain't gonna believe dis shit!\"","What’s the best part of banging twenty-eight year olds? There's twenty of them.","What do niggers and tornadoes have in common? It only takes one to ruin a neighborhood.","What do you call a Muslim with a pressure cooker? A chef, you fucking racist.","What do you call a kid with one arm, one leg and an eyepatch? Names.","What has five legs, four toes, and seven arms? The finish line of the Boston Marathon.","What do you call an abortion vacuum? A womb-a.","What's the difference between jelly and jam? You can't jelly a dick into an asshole.","How many jews can you fit into a Volkswagen Beetle? 5. Two in the front, three in the back, and none in the ashtray because the Holocaust never happened.","Have you ever had Ethiopian food? Neither have they.","What is a Mexican's favorite sport? Cross-country.","What's the hardest part about eating vegetables? Getting them out of the wheelchair.","Politicians and diapers have one thing in common: they should both be changed regularly… and for the same reason.","What's worse than finding a worm in your apple? The Holocaust.","Little Mary is waiting in a line in a camp. Her turn comes to enter the chamber, when she tells Hitler \"Uncle Adolf, It's my birthday today, I want to live longer\". Hitler responds: \"Alright, Mary. Move to the back of the line.\"","What do you call an elevater filled with white people? A box of crackers.","The energizer bunny was arrested on a charge of battery.","How do you know that the prostate exam is going horribly wrong? When the doctor places both hands on your shoulders.","Why did the boy drop his ice cream? Because he was hit by a bus.","Having sex in an elevator is wrong on so many levels.","What's the difference between a feminist and a garbage can? A garbage can gets picked up.","The man who created Autocorrect has died. Restaurant In Peace.","If con is the opposite of pro, then is Congress the opposite of progress?","If my grandma knew how much I spent on her funeral, she'd be spinning in her ditch.","I bought my son a trampoline for his birthday, and he hasn't even used it. He just sits and cries in his wheelchair.","Your face is proof that God has a sense of humor.","What do you call it when a mom has twin retards? Doubling Down.","Yo mamma so fat, when she plays paintball her teammates hide behind her.","You've seen 'Elf on the Shelf', but now watch for 'Kirby on a Furby!'","You've seen 'Elf on the Shelf', but now watch for 'Yatzee on a Nazi!'","You've seen 'Elf on the Shelf', but now watch for 'Tigger on a Nigger!'","You've seen 'Elf on the Shelf', but now watch for 'Piglet on a Niglet!'","My Uncle always said \"Do something you love and you'll never work a day in your life!\" He did heroin.","What's the biggest lie in the entire Universe? \"I have read and agree to the Terms of Service.\"","Q: What's the difference between a naked white woman and a naked black woman? A: One is on the cover of Playboy and the other is on the cover of National Geographic.","How do you blindfold a Chinese person? Put floss over their eyes.","What's the difference between an iPhone X and an ounce of gold? An ounce of gold will still be worth a grand next year.","Don't be racist; racism is a crime; and crime is for black people!","Have you heard about McDonald’s new Obama Value Meal? Order anything you like and the guy behind you has to pay for it.","I saw an ad for burial plots, and thought to myself this is the last thing I need.","What sound does a Nazi train make? Jew Jew!","How do you stop a bunch of black guys from raping a girl? Throw them a basketball.","Did you hear about the homosexual letter? Only came in male boxes.","If there was a competition for saggy tits, your mom would beat everyone. In fact, she'd wipe the floor with them.","What's 10 inches long, hard as a rock, full of semen and makes all of the ladies scream? The sock under my bed.","Why can't Atheists solve exponential equations? Because they don't believe in higher powers.","You won't drink away the alcoholism.","What do parents and pizza have in common? When they're black, you have nothing to eat.","There's no 'I' in \"team,\" but there's a whole lot of 'U' in \"shut the fuck up\"","I just found out my boyfriend is gay. I had been suspecting it for a while, but it wasn't until he sucked my dick that I knew for sure.","I hate peer pressure and you should too.","Waking up this morning was an eye-opening experience.","My girlfriend dumped me on 9/11. That's one way of making sure I'll never forget.","How do you know when a woman is about to say something smart? When she starts her sentence with, \"A man once told me...\"","Where do you send Jewish kids with ADHD? Concentration Camp!","The future, the present and the past walked into a bar. Things got a little tense.","What's six inches long, two inches wide, and drives women wild? Money.","I jokingly told my friend I was collecting the corpses of past emperors of Russia and dumping them into a giant ravine, but he thought I was serious and asked what was wrong with me. I guess he just doesn't understand tsar chasm.","I got in trouble the other day for making fun of a couple of hipsters. Apparently the correct term is \"conjoined twins.\"","What do we want!? A cure for Tourettes! When do we want it!? CUNT!","A black guy walks into a bar with a parrot on his shoulder and asks for a beer. The bartender brings a beer and notices the parrot on his shoulder and says, \"Hey that's really neat. Where did you get it?\" The parrot responds, \"In the jungle, there's millions of them.\"","Why did the blonde scale the glass wall? To see what was on the other side.","I've discovered I have a logic fetish. I can't stop coming to conclusions.","What is the name of an Asian pilot who died in a plane crash? Sum Ting Wong.","Little Susie comes to Adolf and asks: \"Adolf, could I see my parents some time soon?\" Adolf responds \"Yeah, sure, 3rd soap on the left.\"","Why don't you throw a rock at a black kid on a bike? You might hit your bike.","Why does Beyonce sing \"to the left, to the left\"? Because black people have no rights!","My dad died when we couldn't remember his blood type. As he died, he kept insisting for us to \"be positive,\" but it's hard without him.","It's funny making a Flat Earth believer angry, but if you push them over the edge then you're only proving them right.","I hate people who use big words just to make themselves look perspicacious.","A guy dies and goes to Hell. In Hell he finds that it's much more of an empty wasteland than the whole fire and brimstone thing he was told it would be. After wandering for a while he comes across a bar. Inside the bar drinking is Hitler, Himmler, Goebbels, Goring, Borman, and Mengele. The man asks the bartender \"Is that really Hitler and his crew?\" and the bartender replied \"Why yes it is, would you like to talk to him?\" The man said \"yes\" and went over to Hitler and his buddies. Without hesitation he asked Hitler, \"How many people did you kill in the Holocaust?\" Hitler replied, \"6 million Jews, 3 million Gypsies, about a million homosexuals and retards, and 12 spotted owls.\" Curious as to why Hitler would kill spotted owls, the man asked, \"Why did you kill the spotted owls?\" After hearing this Hitler looked at Goebbels and said, \"See, I told you no one gave a shit about 6 million Jews!\"","College is the opposite of kidnapping. They demand $100,000 from you or they'll send your kid back.","You shouldn't have unprotected phone sex, you might get hearing aids.","My girlfriend told me I'm bad in bed. I told her she should learn to enjoy the little things in life.","A robber comes into the store & steals a TV. A blonde runs after him and says, \"Wait, you forgot the remote!\"","Why are most politicans in the closet or gay? Because they can only mandate.","How do you embarrass an archaeologist? Give him a used tampon and ask him which period it came from.","What's the difference between Santa and a Jew? Santa goes down the chimney.","Did you hear about the gay security guard who got fired from his job at the sperm bank? He got caught drinking on the job.","What's the worst part about being a black Jew? You have to sit at the back of the gas chamber.","I wanna make a joke about sodium, but Na..","What do you call an unorganized group of cats? A catastrophe!","Cigarettes aren't good for you, neither are women but I ain't about to go gay.","For a laugh, I shoved my friend's brother into the swimming pool when I was at his house and everyone got really angry. They said I was disgusting and none of them want anything to do with me again. Bit of a strong reaction, I feel, but maybe they didn't want the wheelchair to rust.","Why do the shower heads have 11 holes in them? Because the Jews only have 10 fingers.","I like Jesus but he loves me, so it's awkward.","Why do blacks smell? So blind people can hate them too.","What do you call a cheap circumsicion? A rip off.","I named my kid Bob Ross. He was a happy little accident.","Last year Apple released the iPhone SE and 7, this year it was 8/10. Are we going to find out next year that Apple did 9/11?","One day, a little boy wrote to Santa Clause, \"Please send me a sister.\" Santa Clause wrote him back, \"Ok, send me your mother.\"","My girlfriend's dad asked me what I do. Apparently, \"your daughter\" wasn't the right answer.","How is rape and an airplane similar? The ride gets more annoying when the kid starts screaming.","Why does Japan have so many skinny people? Last time they had a fat man, they lost a city.","I'd like to see things from your point of view but I can't seem to get my head that far up my ass.","What does a gay man and an ambulance have in common? They both get loaded from the rear and go whoo-whoo!","Q: Is Google male or female? A: Female, because it doesn't let you finish a sentence before making a suggestion.","When you die your voice gets added to the Big Bang Theory laugh track.","What do potato chips and feminism have in common? They're both filled with trans fats.","I opened a company selling land mines disguised as prayer mats. Prophets are going through the roof!","What's the first thing I do after having sex? I go for a run, I can't risk getting caught.","What do you get when you cross a joke with a rhetorical question?","I could tell my parents hated me, my bath toys were a toaster and a radio.","If electricity comes from electrons, does morality come from morons?","First rule of Vegan Club: Tell everyone about Vegan Club.","My hot lesbian neighbours got me a Rolex for my birthday. It's nice, but I think they misunderstood me when I said, \"I wanna watch.\"","Sex is like air; it's not important unless you arent getting any.","The doctor gave me 6 months to live. So I killed him. The judge gave me 80 years. Problem solved.","I bought a trash compactor for my ex-wife, Or, as Victoria Secret calls it - a corset","Masturbation is like procrastination, it's all good and fun until you realize you are only fucking yourself!","My girlfriend accused me of cheating the other day. I told her she was starting to sound like my wife.","I threw an Asian man down a flight of stairs. It was Wong on so many levels.","Trump has two parts of brain, 'left' and 'right'. In the left side, there's nothing right. In the right side, there's nothing left.","If you dont believe in oral sex, keep your mouth shut.","What do you call it when a blonde dies their hair brunette? Artificial intelligence.","I just found out I'm colorblind. The diagnosis came completely out of the purple.","I stole a comb from a kid with cancer. Oh well, he doesn't need it now.","What's the difference between a paycheck and a penis? You don't have to beg your wife to blow your paycheck.","My dad used to always warn me about anal. He would say \"Now son, this may hurt a bit.\"","Q: When can women make you a millionaire? A: When you're a billionaire.","A couple years ago my therapist told me I had problems letting go of the past.","What do you call a black man that flies a plane? A pilot.","Throwing acid is wrong, in some people's eyes.","I saw four guys beating up a guy so I decided to help out. He never stood a chance against the five of us.","I asked a Chinese girl for her number. She said, \"Sex! Sex! Sex! Free sex tonight!\" I said, \"Wow!\" Then her friend said, \"She means 666-3629.\"","I have a lot in common in batteries, I'm never included.","Children in the back seats of cars cause accidents, but accidents in the back seats of cars cause children.","I like my grilled cheese like I like my Vietnamese villagers. Yellow and melting.","Did you hear about the guy who died of a Viagra overdose? They couldn't close his casket.","A cop pulled me over, came up to my window, and said \"papers.\" I said \"scissors, I win\" and drove off... that fucker must really need a rematch because he's been chasing me for the last 20 minutes.","Know what the hardest part of riding a scooter is? Telling your parents you're gay.","A doctor tells a woman she can no longer touch anything alcoholic. So she gets a divorce.","Yo momma so fat, when she plays paintball her teammates hide behind her.","I hate girls that complain about being single every 3 minutes. 90% of my socks are single & you don't see them crying about it.","How can you tell if an orange is male or female? If it squirts in your eye without warning it's a male. If it's bitter for no fucking reason, it's a female.","How do you know if your girlfriend is too young for you? You have to make airplane noises to get your dick into her mouth.","What do Christina Grimmie and a bowling ball have in common? They both can't make money unless someone puts holes in them.","What do you call a blind guy's cum? Can't see-men.","The other day, I saw the headline, \"Woman Beats Off Rapist\" and I thought, \"That seems like a reasonable compromise.\"","My favorite sex position is the WOW. That's when I flip your MOM over.","I bought the black iPhone because I heard it runs faster. Turns out it doesn't even work.","Where do blacks go to confess their sins? The interrogation room.", "Schools are racist. They've been replacing all of the blackboards with whiteboards saying that whiteboards are better and look more pleasant to the eyes."]
}